Import Packages
Load the input
Basic Check and EDA
Train-Test-Split
Define the model
Training
Prediction
Evalution

In [1]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score, mean_absolute_error, mean_squared_error

In [2]:
data=pd.read_csv('Data/hp_data.csv')
data.head()

,place,built,sqft,sale,yearsOld,floor,totalFloor,bhk,price
0,BTM Layout,Super built-up Area,1450,Resale,5,1,4,1,6300000
1,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3,11500000
2,Whitefield,Super built-up Area,1019,Resale,1,2,5,2,3800000
3,Ambalipura,Super built-up Area,1857,Resale,15,4,5,4,10500000
4,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3,11500000

In [3]:
data.shape

(3500, 9)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3500 entries, 0 to 3499
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   place       3500 non-null   object
 1   built       3500 non-null   object
 2   sqft        3500 non-null   int64
 3   sale        3500 non-null   object
 4   yearsOld    3500 non-null   int64
 5   floor       3500 non-null   int64
 6   totalFloor  3500 non-null   int64
 7   bhk         3500 non-null   int64
 8   price       3500 non-null   int64
dtypes: int64(6), object(3)
memory usage: 246.2+ KB

In [5]:
data.corr()

                sqft  yearsOld     floor  totalFloor       bhk     price
sqft        1.000000  0.229461  0.356053    0.358946  0.356053  0.778364
yearsOld    0.229461  1.000000 -0.116427   -0.142562 -0.116427  0.215712
floor       0.356053 -0.116427  1.000000    0.958100  1.000000  0.263472
totalFloor  0.358946 -0.142562  0.958100    1.000000  0.958100  0.402256
bhk         0.356053 -0.116427  1.000000    0.958100  1.000000  0.263472
price       0.778364  0.215712  0.263472    0.402256  0.263472  1.000000

In [6]:
data.isnull().sum()

place         0
built         0
sqft          0
sale          0
yearsOld      0
floor         0
totalFloor    0
bhk           0
price         0
dtype: int64

In [7]:
#sqft totalfloor Bhk
X= data.loc[:,['sqft','totalFloor','bhk']]
y=data.price
y

0        6300000
1       11500000
2        3800000
3       10500000
4       11500000
          ...
3495     3800000
3496     6300000
3497     7350000
3498     4800000
3499     3800000
Name: price, Length: 3500, dtype: int64

In [8]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.66,)

In [9]:
model=LinearRegression()

In [10]:
model

LinearRegression()

In [11]:
model.fit(X_train,y_train)

LinearRegression()

In [12]:
price_predict=model.predict(X_test) #input of testing data
price_predict

array([13020154.41356954,  9102261.03193085,  1718649.08878876, ...,
        8752844.18819877,  5899839.04419809,  9102261.03193085])

In [13]:
r2_score(y_test,price_predict)

0.8326699734269413

In [14]:
X_test

      sqft  totalFloor  bhk
5     1672          10    6
748   1784          18   18
1643  1100           4    3
763   1330           4    1
2100  1672          10    6
...    ...         ...  ...
3037  1450           4    1
1691  2190           5    3
3247  1857           5    4
2113  1200           4    1
817   1784          18   18

[2310 rows x 3 columns]

In [15]:
mean_absolute_error(y_test,price_predict)

1642420.7054371082

In [16]:
mean_squared_error(y_test,price_predict)

4175920509355.1523

In [29]:
model.predict([[1500,1,2]]).round(2)

array([1438071.05])